import React from "react";
import { useEffect, useState } from "react";
import { BrowserRouter as Router, Route } from "react-router-dom";

//Создать карту для алгоритма A_star используя canvas или что-то другое
// Бонусный вариант - вы генерируете карту-лабиринт (можно использовать алгоритмы генерации лабиринтов на основе алгоритмов Прима/Краскала) на карте размером n*n, вы позволяете пользователю модернизировать этот лабиринт, добавив/убавив непроходимые клетки, клетку начала и конца пути. Далее при запуске отрисовывается анимация поиска и прохождения пути на каждой итерации алгоритма (вы показываете, какие клетки рассматриваются алгоритмом, какие выбраны и какие анализируются для построения маршрута) в режиме реального времени.

const Map = () => {};
